# Depth Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPartSizeMap..::..Depth Property
FabricationPartSizeMap Class See Also
---
The depth of the straight.
**Namespace:** Autodesk.Revit.DB.Fabrication**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.2
# Syntax
C#
---
```text
public double Depth { get; set; }
```

Visual Basic
---
```text
Public Property Depth As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Depth {
	double get ();
	void set (double value);
}
```

# See Also
FabricationPartSizeMap Class
Autodesk.Revit.DB.Fabrication Namespace